<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 权限管理开关
    'on'        => true,
    // 权限管理控制类型 1：即时控制 2：登录控制
    'type'      => 2,
    // 数据表名字
    'table'     => [
        'admin'      => 'admin',
        'admin_role' => 'admin_role',
        'role'       => 'role',
        'role_node'  => 'role_node',
        'node'       => 'node',
    ],
    // 例外 不需要权限 控制器 => [方法, 方法]
    'exception' => [],
    // 超级管理员
    'super'     => ['akali'],
    // 是否只显示有权限的导航栏
    'show'      => true,
];
