<?php
// +----------------------------------------------------------------------
// | Captcha配置文件
// +----------------------------------------------------------------------

return [

    // 用户注册的验证码设置
    'register' => [
        //验证码位数
        'length'   => 4,
        //验证码字符大小
        'fontSize' => 25,
        // 是否使用混淆曲线
        'useCurve' => false,
        // 验证码字体 不设置则随机
        'fontttf'  => '2.ttf',
    ],
    // 用户登录的验证码设置
    'login' => [
        //验证码位数
        'length'   => 4,
        //验证码字符大小
        'fontSize' => 25,
        // 是否使用混淆曲线
        'useCurve' => true,
        // 验证码字体 不设置则随机
        'fontttf'  => '2.ttf',
    ],
];
